app/controllers/school_classes_controller.rb

  def update
    @school_class.update(school_class_params)
---
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "fdaf222"], ["room_number", 22222], ["updated_at", "2017-03-01 21:42:07.053414"], ["id", 3]]

    def set_school_class
      @school_class = SchoolClass.find(params[:id])
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", 5]]