app/controllers/students_controller.rb

  def update
    @student.update(student_params)
---
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "rrrrrr"], ["last_name", "rrrrrdadfasfdaf"], ["updated_at", "2017-03-01 21:40:23.632493"], ["id", 8]]